In [ ]:
============================= EDA ===========================
1) Pandas: Data frame application (how to read, write & modify will run by pandas package)

2) Numpy: Numerical python (Mean, median, mode, sin, cos, all math applications)

3) matplotlib: It is used for plotting

4) Seaborn: used for plot (plotting is different ways of using graphs)

5) plotly: used for plot

6) Bokhe: used for plot

============================= Machine Learning =============================

7) sickit-learn :sklearn (important package)

============================ Deep learning =================================

8) Tensorflow : Google

9) Keras: Google

10) pytorch: Facebook

============================ NLP =======================================

11) NLTK: Natural language tool kit

12) Scipy : developed by NLP 

============================== BERT ====================================

13) Transformers: Hugging Face (Google)

============================ Google Models ===========================

14) Specific google packages

=========================== Azure ML =================================

15) Azure packages

========================== GenAI =====================================

16) GeminiAI : Google

17) ChatGPT: openAI

========================= LangChain =================================

18) LangChain packages

$Step-1:$

**Create a DataFrame using list**

In [ ]:
- list === dictionary

- dictionary === list

In [2]:
import pandas as pd
names=['Ayush', 'Avinash', 'Akash']
pd.DataFrame # empty DataFrame no rows no columns

Empty DataFrame
Columns: []
Index: []

$Step-2:$

In [3]:
names=['Ayush','Avinash','Akash']
pd.DataFrame(names)

         0
0    Ayush
1  Avinash
2    Akash

In [8]:
names=['Ayush','Avinash','Akash']
age=[20,25,30]
pd.DataFrame(zip(names,age))
# what is the first positional argument: Data
# what is the second positional argument: Index
# whenever we have multiple list, we have to use "zip"

         0   1
0    Ayush  20
1  Avinash  25
2    Akash  30

In [10]:
names=['Ayush','Avinash','Akash']
age=[20,25,30]
salary=[20000,25000,30000]
city=['hyd','blr','chennai']
pd.DataFrame(zip(names,age,salary),city)

               0   1      2
hyd        Ayush  20  20000
blr      Avinash  25  25000
chennai    Akash  30  30000

$Step-3:$

**Provide the column names**

In [14]:
names=['Ayush','Avinash','Akash']
age=[20,25,30]
city=['hyd','blr','chennai']
pd.DataFrame(zip(names,age),
             columns=['Names','Age'])

     Names  Age
0    Ayush   20
1  Avinash   25
2    Akash   30

In [19]:
names=['Ayush','Avinash','Akash']
age=[20,25,30]
city=['Hyderabad','Banglore','chennai']
salary=[20000,30000,35000]
pd.DataFrame(zip(names,age,salary,city),
             columns=['Names','Age','Salary','City'])

     Names  Age  Salary       City
0    Ayush   20   20000  Hyderabad
1  Avinash   25   30000   Banglore
2    Akash   30   35000    chennai

In [22]:
names=['Ayush','Avinash','Akash']
age=[20,25,30]
city=['Hyderabad','Banglore','chennai']
salary=[20000,30000,35000]

data=zip(names,age,salary,city)
cols=['Names','Age','Salary','City']
pd.DataFrame(data,columns=cols)

     Names  Age  Salary       City
0    Ayush   20   20000  Hyderabad
1  Avinash   25   30000   Banglore
2    Akash   30   35000    chennai

In [24]:
names=['Ayush','Avinash','Akash']
age=[20,25,30]
city=['Hyderabad','Banglore','chennai']
salary=[20000,30000,35000]

data=zip(names,age,salary,city)
cols=['Names','Age','Salary','City']
df=pd.DataFrame(data,columns=cols)

In [25]:
type(df)

pandas.core.frame.DataFrame

$Step-4:$

**Add New Column**

- if you want to add new column

- first, you need to check the number of rows in already existing data

- For example, above dataframe has 3 rows

- you need to create a new list with 3 rows

- that list equate to the dataframe

In [27]:
job=['DS','DE','CS']
df['Job']=job
df

     Names  Age  Salary       City Job
0    Ayush   20   20000  Hyderabad  DS
1  Avinash   25   30000   Banglore  DE
2    Akash   30   35000    chennai  CS

In [28]:
gender= ['Male','Male','Male']
df['Gender']=gender
df

     Names  Age  Salary       City Job Gender
0    Ayush   20   20000  Hyderabad  DS   Male
1  Avinash   25   30000   Banglore  DE   Male
2    Akash   30   35000    chennai  CS   Male

$Step-5$

**Update already existed Column**

- Create new column and update new column, both are same way

In [30]:
df['Age']=[35,40,45]
df
# update already existed column
# how many rows are there,that many values we have to give

     Names  Age  Salary       City Job Gender
0    Ayush   35   20000  Hyderabad  DS   Male
1  Avinash   40   30000   Banglore  DE   Male
2    Akash   45   35000    chennai  CS   Male

$Step-6$:

**How to change the Index**

In [31]:
df

     Names  Age  Salary       City Job Gender
0    Ayush   35   20000  Hyderabad  DS   Male
1  Avinash   40   30000   Banglore  DE   Male
2    Akash   45   35000    chennai  CS   Male

In [51]:
import pandas as pd
names=['Ayush','Avinash','Akash','Anvi']
age=[20,25,30,35]
city=['Hyderabad','Banglore','chennai','Mumbai']

data=zip(names,age,city)
cols=['Names','Age','City']
idx=['A','B','C','D']

df=pd.DataFrame(data,
             index=idx,
             columns=cols)
df

     Names  Age       City
A    Ayush   20  Hyderabad
B  Avinash   25   Banglore
C    Akash   30    chennai
D     Anvi   35     Mumbai

**Note**

- Number of list equals to  **Number of columns**

- Number of values inside list equals to **Number of rows**

- When you create the data all the lists will be in the same length

$Step-7$

**Shape**

- Number of rows

- Number of columns

In [41]:
df.shape
# matrix format
# 4 rows and 3 columns
print("the number of rows are:", df.shape[0])
print("the number of columns are:", df.shape[1])

the number of rows are: 4
the number of columns are: 3

$Step-8$

**How to Drop the column**

- In order to drop the column, we required 3 arguments

- Column name

   - The column name we need to mention
 
- axis:
  
   - axis = 0 **represents rows**
     
   - axis = 1 **represents columns**
 
- Inplace:

   - we are dropping the column means we are modifying the data frame
 
   - so this modifications, we want to save in same variable or different variable
 
   - If you want to keep in the same variable, then **inplace = True**

In [52]:
df.drop('City',
        axis=1,
        inplace=True)

In [53]:
df

     Names  Age
A    Ayush   20
B  Avinash   25
C    Akash   30
D     Anvi   35

In [54]:
df1=df.drop('Age',axis=1) # do not give inplace=True

In [55]:
df1  # df has

     Names
A    Ayush
B  Avinash
C    Akash
D     Anvi

$Step-9$

In [56]:
# again read the data
import pandas as pd
names=['Ayush','Avinash','Akash','Anvi']
age=[20,25,30,35]
city=['Hyderabad','Banglore','chennai','Mumbai']

data=zip(names,age,city)
cols=['Names','Age','City']
idx=['A','B','C','D']

df=pd.DataFrame(data,
             index=idx,
             columns=cols)
df

     Names  Age       City
A    Ayush   20  Hyderabad
B  Avinash   25   Banglore
C    Akash   30    chennai
D     Anvi   35     Mumbai

In [57]:
df.drop(['Age','City'],axis=1,inplace=True)

In [59]:
df # when someone says to drop the multiple columns means, we need to first recollect "list"

     Names
A    Ayush
B  Avinash
C    Akash
D     Anvi

$Step-10:$

**Drop the rows**

In [60]:
# again read the data
import pandas as pd
names=['Ayush','Avinash','Akash','Anvi']
age=[20,25,30,35]
city=['Hyderabad','Banglore','chennai','Mumbai']

data=zip(names,age,city)
cols=['Names','Age','City']
idx=['A','B','C','D']

df=pd.DataFrame(data,
             index=idx,
             columns=cols)
df

     Names  Age       City
A    Ayush   20  Hyderabad
B  Avinash   25   Banglore
C    Akash   30    chennai
D     Anvi   35     Mumbai

In [62]:
df.drop('B',axis=0,inplace=True)

In [63]:
df

   Names  Age       City
A  Ayush   20  Hyderabad
C  Akash   30    chennai
D   Anvi   35     Mumbai

$Step-11$

**How to save in dataframe**

- Generally, data frames are two types

- csv(comma separated vale)

- excel

In [64]:
# file_name= data
# extension= csv
df.to_csv('data.csv')

In [65]:
df.to_csv('data1.csv',index=False)

In [66]:
# Extension
# .xlsx

In [67]:
# again read the data
import pandas as pd
names=['Ayush','Avinash','Akash','Anvi']
age=[20,25,30,35]
city=['Hyderabad','Banglore','chennai','Mumbai']

data=zip(names,age,city)
cols=['Names','Age','City']
idx=['A','B','C','D']

df=pd.DataFrame(data,
             index=idx,
             columns=cols)
df

     Names  Age       City
A    Ayush   20  Hyderabad
B  Avinash   25   Banglore
C    Akash   30    chennai
D     Anvi   35     Mumbai

In [71]:
df.to_excel('data2.xlsx',index=False)